{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
  "@odata.type": "#microsoft.graph.androidManagedAppProtection",
  "createdDateTime": "2024-01-02T22:07:32.0335124Z",
  "lastModifiedDateTime": "2024-01-24T16:56:42Z",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "T_9eff418d-781f-45de-948e-03442517ff0f",
  "version": "\"7a048250-0000-0300-0000-65b1414a0000\"",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundDataTransferDestinations": "allApps",
  "organizationalCredentialsRequired": false,
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": false,
  "deviceComplianceRequired": true,
  "managedBrowserToOpenLinksRequired": false,
  "saveAsBlocked": false,
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 5,
  "simplePinBlocked": false,
  "minimumPinLength": 4,
  "pinCharacterSet": "numeric",
  "periodBeforePinReset": "PT0S",
  "allowedDataStorageLocations": [],
  "contactSyncBlocked": false,
  "printBlocked": false,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": false,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumRequiredOsVersion": null,
  "minimumWarningOsVersion": null,
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeAppVersion": null,
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "pinRequiredInsteadOfBiometricTimeout": null,
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "notificationRestriction": "allow",
  "previousPinBlockCount": 0,
  "managedBrowser": "notConfigured",
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "mobileThreatDefenseRemediationAction": "block",
  "mobileThreatDefensePartnerPriority": null,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera",
    "photoLibrary"
  ],
  "appActionIfUnableToAuthenticateUser": null,
  "dialerRestrictionLevel": "allApps",
  "gracePeriodToBlockAppsDuringOffClockHours": null,
  "protectedMessagingRedirectAppType": "anyApp",
  "isAssigned": true,
  "targetedAppManagementLevels": "unspecified",
  "appGroupType": "allMicrosoftApps",
  "screenCaptureBlocked": true,
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "encryptAppData": true,
  "deployedAppCount": 39,
  "minimumRequiredPatchVersion": "0000-00-00",
  "minimumWarningPatchVersion": "0000-00-00",
  "minimumWipePatchVersion": "0000-00-00",
  "allowedAndroidDeviceManufacturers": null,
  "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
  "appActionIfAccountIsClockedOut": null,
  "appActionIfSamsungKnoxAttestationRequired": null,
  "requiredAndroidSafetyNetDeviceAttestationType": "none",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
  "requiredAndroidSafetyNetAppsVerificationType": "none",
  "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
  "customBrowserPackageId": "",
  "customBrowserDisplayName": "",
  "minimumRequiredCompanyPortalVersion": null,
  "minimumWarningCompanyPortalVersion": null,
  "minimumWipeCompanyPortalVersion": null,
  "keyboardsRestricted": false,
  "allowedAndroidDeviceModels": [],
  "appActionIfAndroidDeviceModelNotAllowed": "block",
  "customDialerAppPackageId": "",
  "customDialerAppDisplayName": "",
  "biometricAuthenticationBlocked": false,
  "requiredAndroidSafetyNetEvaluationType": "basic",
  "blockAfterCompanyPortalUpdateDeferralInDays": 0,
  "warnAfterCompanyPortalUpdateDeferralInDays": 0,
  "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
  "deviceLockRequired": false,
  "appActionIfDeviceLockNotSet": "block",
  "connectToVpnOnLaunch": false,
  "appActionIfDevicePasscodeComplexityLessThanLow": null,
  "appActionIfDevicePasscodeComplexityLessThanMedium": null,
  "appActionIfDevicePasscodeComplexityLessThanHigh": null,
  "requireClass3Biometrics": false,
  "requirePinAfterBiometricChange": false,
  "fingerprintAndBiometricEnabled": true,
  "messagingRedirectAppPackageId": "",
  "messagingRedirectAppDisplayName": "",
  "exemptedAppPackages": [],
  "approvedKeyboards": [],
  "displayName": "Android Application Security",
  "description": "",
  "Type": "AppProtection",
  "GUID": "b83bfc55-620a-495a-8cc0-0cf17a5bbc2a"
}
