{
  "added": [
    {
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('cfac692b-fc00-490c-91ca-38d4372ddcbb')",
      "enabled": false,
      "presentationValues": []
    }
  ],
  "updated": [],
  "deletedIds": [],
  "displayName": "Block outdated ActiveX controls for Internet Explorer",
  "description": "Block outdated ActiveX controls for Internet Explorer and increases the Microsoft Secure Score. \n\nDeployed by CIPP\n",
  "Type": "Admin",
  "GUID": "b4216136-4ec2-41b0-a0cc-011e1fa508a7"
}
