{
  "added": [
    {
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('c261d127-5d9c-4f7c-bdca-10a81da639e8')",
      "enabled": false,
      "presentationValues": []
    },
    {
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('0ed0607f-2dc8-4d1b-8472-1da2f8c9f9db')",
      "enabled": false,
      "presentationValues": []
    }
  ],
  "updated": [],
  "deletedIds": [],
  "displayName": "Disable 'Allow Basic authentication' for WinRM Service and Client",
  "description": "This Disable 'Allow Basic authentication' for WinRM Service and Client and increases the Microsoft Secure Score.",
  "Type": "Admin",
  "GUID": "b5893427-5351-4227-b336-ebf4b4982464"
}
