{
  "added": [
    {
      "enabled": true,
      "presentationValues": [],
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('9a4db949-29e4-4e31-a129-bf2b88d8fa1b')"
    },
    {
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "value": "%tenantid%",
          "presentation@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('39147fa2-6c5e-437b-8264-19b50b891709')/presentations('fbefbbdf-5382-477c-8b6c-71f4a06e2805')"
        },
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "value": "0",
          "presentation@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('39147fa2-6c5e-437b-8264-19b50b891709')/presentations('35c82072-a93b-4022-be14-8684c2f6fcc2')"
        }
      ],
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('39147fa2-6c5e-437b-8264-19b50b891709')"
    },
    {
      "enabled": true,
      "presentationValues": [],
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('81c07ba0-7512-402d-b1f6-00856975cfab')"
    },
    {
      "enabled": true,
      "presentationValues": [],
      "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('61b07a01-7e60-4127-b086-f6b32458a5c5')"
    }
  ],
  "updated": [],
  "deletedIds": [],
  "displayName": "Enable Onedrive Silent Logon and Known Folder Move",
  "description": "This policy enables Onedrive Silent Logon and Known Folder move",
  "Type": "Admin",
  "GUID": "7b41924e-3051-4a23-b0d0-8cdeadc2c05a.IntuneTemplate.json"
}
