{
  "id": "00000000-0000-0000-0000-000000000000",
  "roleScopeTagIds": [
    "0"
  ],
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "applicationGuardEnabledOptions": "notConfigured",
  "firewallCertificateRevocationListCheckMethod": "deviceDefault",
  "firewallPacketQueueingMethod": "deviceDefault",
  "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
  "defenderSecurityCenterNotificationsFromApp": "notConfigured",
  "windowsDefenderTamperProtection": "notConfigured",
  "defenderSecurityCenterITContactDisplay": "notConfigured",
  "xboxServicesAccessoryManagementServiceStartupMode": "manual",
  "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
  "xboxServicesLiveGameSaveServiceStartupMode": "manual",
  "xboxServicesLiveNetworkingServiceStartupMode": "manual",
  "applicationGuardBlockClipboardSharing": "notConfigured",
  "defenderPreventCredentialStealingType": "notConfigured",
  "defenderAdobeReaderLaunchChildProcess": "notConfigured",
  "defenderOfficeCommunicationAppsLaunchChildProcess": "notConfigured",
  "defenderAdvancedRansomewareProtectionType": "notConfigured",
  "defenderNetworkProtectionType": "notConfigured",
  "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
  "localSecurityOptionsSmartCardRemovalBehavior": "lockWorkstation",
  "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
  "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "none",
  "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "none",
  "lanManagerAuthenticationLevel": "lmAndNltm",
  "localSecurityOptionsAdministratorElevationPromptBehavior": "notConfigured",
  "localSecurityOptionsStandardUserElevationPromptBehavior": "notConfigured",
  "userRightsAccessCredentialManagerAsTrustedCaller": null,
  "userRightsLocalLogOn": null,
  "userRightsAllowAccessFromNetwork": null,
  "userRightsActAsPartOfTheOperatingSystem": null,
  "userRightsBackupData": null,
  "userRightsChangeSystemTime": null,
  "userRightsCreateGlobalObjects": null,
  "userRightsCreatePageFile": null,
  "userRightsCreatePermanentSharedObjects": null,
  "userRightsCreateSymbolicLinks": null,
  "userRightsCreateToken": null,
  "userRightsDebugPrograms": null,
  "userRightsBlockAccessFromNetwork": null,
  "userRightsDenyLocalLogOn": null,
  "userRightsRemoteDesktopServicesLogOn": null,
  "userRightsDelegation": null,
  "userRightsGenerateSecurityAudits": null,
  "userRightsImpersonateClient": null,
  "userRightsIncreaseSchedulingPriority": null,
  "userRightsLoadUnloadDrivers": null,
  "userRightsLockMemory": null,
  "userRightsManageAuditingAndSecurityLogs": null,
  "userRightsManageVolumes": null,
  "userRightsModifyFirmwareEnvironment": null,
  "userRightsModifyObjectLabels": null,
  "userRightsProfileSingleProcess": null,
  "userRightsRemoteShutdown": null,
  "userRightsRestoreData": null,
  "userRightsTakeOwnership": null,
  "bitLockerRecoveryPasswordRotation": "notConfigured",
  "bitLockerPrebootRecoveryMsgURLOption": "default",
  "bitLockerEncryptDevice": true,
  "bitLockerDisableWarningForOtherDiskEncryption": true,
  "bitLockerAllowStandardUserEncryption": true,
  "bitLockerSyntheticSystemDrivePolicybitLockerDriveRecovery": true,
  "applicationGuardAllowPrintToPDF": false,
  "applicationGuardAllowPrintToXPS": false,
  "applicationGuardAllowPrintToLocalPrinters": false,
  "applicationGuardAllowPrintToNetworkPrinters": false,
  "bitLockerFixedDrivePolicy": {
    "requireEncryptionForWriteAccess": false,
    "recoveryOptions": null,
    "encryptionMethod": null
  },
  "bitLockerRemovableDrivePolicy": {
    "requireEncryptionForWriteAccess": false,
    "encryptionMethod": null
  },
  "bitLockerSystemDrivePolicy": {
    "startupAuthenticationRequired": true,
    "startupAuthenticationTpmUsage": "allowed",
    "startupAuthenticationTpmPinUsage": "allowed",
    "startupAuthenticationTpmKeyUsage": "allowed",
    "startupAuthenticationTpmPinAndKeyUsage": "allowed",
    "startupAuthenticationBlockWithoutTpmChip": false,
    "minimumPinLength": null,
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "recoveryPasswordUsage": "allowed",
      "recoveryKeyUsage": "allowed",
      "enableRecoveryInformationSaveToStore": true,
      "recoveryInformationToStore": "passwordAndKey",
      "enableBitLockerAfterRecoveryInformationToStore": true
    },
    "prebootRecoveryEnableMessageAndUrl": false,
    "encryptionMethod": null
  },
  "firewallProfileDomain": null,
  "firewallProfilePrivate": null,
  "firewallProfilePublic": null,
  "deviceGuardEnableVirtualizationBasedSecurity": false,
  "deviceGuardEnableSecureBootWithDMA": false,
  "displayName": "Enable Bitlocker Encryption for OS drives",
  "description": "Enables Bitlocker and stores the key in Azure AD for system Drives",
  "Type": "Device",
  "GUID": "7e06b0de-0469-4aae-89be-d83c44b5799f.IntuneTemplate.json"
}
