{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
  "@odata.type": "#microsoft.graph.iosManagedAppProtection",
  "createdDateTime": "2024-01-02T16:34:57.5830773Z",
  "lastModifiedDateTime": "2024-01-04T14:05:45Z",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "T_86edfacb-5a2c-4ab4-b78b-197cc414b2bc",
  "version": "\"2a013288-0000-0300-0000-6596bb390000\"",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "organizationalCredentialsRequired": false,
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": false,
  "deviceComplianceRequired": true,
  "managedBrowserToOpenLinksRequired": false,
  "saveAsBlocked": true,
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 5,
  "simplePinBlocked": false,
  "minimumPinLength": 4,
  "pinCharacterSet": "numeric",
  "periodBeforePinReset": "PT0S",
  "allowedDataStorageLocations": [
    "oneDriveForBusiness",
    "sharePoint"
  ],
  "contactSyncBlocked": false,
  "printBlocked": false,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": false,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumRequiredOsVersion": null,
  "minimumWarningOsVersion": null,
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeAppVersion": null,
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "pinRequiredInsteadOfBiometricTimeout": null,
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "notificationRestriction": "allow",
  "previousPinBlockCount": 0,
  "managedBrowser": "notConfigured",
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "mobileThreatDefenseRemediationAction": "block",
  "mobileThreatDefensePartnerPriority": null,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera",
    "photoLibrary"
  ],
  "appActionIfUnableToAuthenticateUser": null,
  "dialerRestrictionLevel": "allApps",
  "gracePeriodToBlockAppsDuringOffClockHours": null,
  "protectedMessagingRedirectAppType": "anyApp",
  "isAssigned": true,
  "targetedAppManagementLevels": "unspecified",
  "appGroupType": "allMicrosoftApps",
  "appDataEncryptionType": "whenDeviceLocked",
  "minimumRequiredSdkVersion": null,
  "deployedAppCount": 38,
  "faceIdBlocked": false,
  "minimumWipeSdkVersion": null,
  "allowedIosDeviceModels": null,
  "appActionIfIosDeviceModelNotAllowed": "block",
  "thirdPartyKeyboardsBlocked": false,
  "filterOpenInToOnlyManagedApps": false,
  "disableProtectionOfManagedOutboundOpenInData": false,
  "protectInboundDataFromUnknownSources": false,
  "customBrowserProtocol": "",
  "customDialerAppProtocol": "",
  "managedUniversalLinks": [
    "http://*.appsplatform.us/*",
    "http://*.onedrive.com/*",
    "http://*.powerapps.cn/*",
    "http://*.powerapps.com/*",
    "http://*.powerapps.us/*",
    "http://*.powerbi.com/*",
    "http://*.service-now.com/*",
    "http://*.sharepoint-df.com/*",
    "http://*.sharepoint.com/*",
    "http://*.yammer.com/*",
    "http://*.zoom.us/*",
    "http://*collab.apps.mil/l/*",
    "http://*devspaces.skype.com/l/*",
    "http://*teams-fl.microsoft.com/l/*",
    "http://*teams.live.com/l/*",
    "http://*teams.microsoft.com/l/*",
    "http://*teams.microsoft.us/l/*",
    "http://app.powerbi.cn/*",
    "http://app.powerbi.de/*",
    "http://app.powerbigov.us/*",
    "http://msit.microsoftstream.com/video/*",
    "http://tasks.office.com/*",
    "http://to-do.microsoft.com/sharing*",
    "http://web.microsoftstream.com/video/*",
    "http://zoom.us/*",
    "https://*.appsplatform.us/*",
    "https://*.onedrive.com/*",
    "https://*.powerapps.cn/*",
    "https://*.powerapps.com/*",
    "https://*.powerapps.us/*",
    "https://*.powerbi.com/*",
    "https://*.service-now.com/*",
    "https://*.sharepoint-df.com/*",
    "https://*.sharepoint.com/*",
    "https://*.yammer.com/*",
    "https://*.zoom.us/*",
    "https://*collab.apps.mil/l/*",
    "https://*devspaces.skype.com/l/*",
    "https://*teams-fl.microsoft.com/l/*",
    "https://*teams.live.com/l/*",
    "https://*teams.microsoft.com/l/*",
    "https://*teams.microsoft.us/l/*",
    "https://app.powerbi.cn/*",
    "https://app.powerbi.de/*",
    "https://app.powerbigov.us/*",
    "https://msit.microsoftstream.com/video/*",
    "https://tasks.office.com/*",
    "https://to-do.microsoft.com/sharing*",
    "https://web.microsoftstream.com/video/*",
    "https://zoom.us/*"
  ],
  "exemptedUniversalLinks": [
    "http://facetime.apple.com",
    "http://maps.apple.com",
    "https://facetime.apple.com",
    "https://maps.apple.com"
  ],
  "minimumWarningSdkVersion": null,
  "messagingRedirectAppUrlScheme": "",
  "exemptedAppProtocols": [
    {
      "name": "Default",
      "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
    }
  ],
  "displayName": "Baseline Application Security for iOS",
  "description": "",
  "Type": "AppProtection",
  "GUID": "00ce1ea5-654f-4129-8fb3-0fff046879b3"
}
