{
  "name": "LAPS",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
        },
        "choiceSettingValue": {
          "value": "device_vendor_msft_laps_policies_backupdirectory_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
            "useTemplateDefault": false
          },
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad",
              "settingInstanceTemplateReference": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 30
              }
            }
          ]
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
        },
        "choiceSettingValue": {
          "value": "device_vendor_msft_laps_policies_passwordcomplexity_4",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01",
            "useTemplateDefault": false
          },
          "children": []
        }
      }
    }
  ],
  "platforms": "windows10",
  "technologies": "mdm",
  "templateReference": {
    "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
    "templateFamily": "endpointSecurityAccountProtection",
    "templateDisplayName": "Local admin password solution (Windows LAPS)",
    "templateDisplayVersion": "Version 1"
  },
  "displayName": "LAPS",
  "description": "",
  "Type": "Catalog",
  "GUID": "59bd753c-4204-4b3a-b84b-850d4b69f494"
}
