{
  "name": "Set LAN Manager authentication level to 'Send NTLMv2 response only. Refuse LM & NTLM'",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_5",
          "children": []
        }
      }
    }
  ],
  "platforms": "windows10",
  "technologies": "mdm",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "displayName": "Set LAN Manager authentication level to 'Send NTLMv2 response only. Refuse LM & NTLM'",
  "description": "Set LAN Manager authentication level to 'Send NTLMv2 response only. Refuse LM & NTLM' \n\nincreases the Microsoft Secure Score.",
  "Type": "Catalog",
  "GUID": "970eb5a5-16e9-44ab-91f3-d37a4aaf2398"
}
