{
  "name": "Web Sign-in Credential Provider",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_authentication_enablewebsignin",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_authentication_enablewebsignin_1",
          "children": []
        }
      }
    }
  ],
  "platforms": "windows10",
  "technologies": "mdm",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "displayName": "Web Sign-in Credential Provider",
  "description": "This will allow Temporary Access Password Sign In on Azure AD joined machines",
  "Type": "Catalog",
  "GUID": "12ed2211-f946-4646-ba71-6882ab135c7f"
}
